STMicroelectronics/STM32CubeH7/Projects/STM32H7B3I-EVAL/Demonstrations/ClockAndWeather/TouchGFX/target/BoardConfiguration.cpp

#include <common/TouchGFXInit.hpp>
#include <touchgfx/hal/BoardConfiguration.hpp>
#include <touchgfx/hal/GPIO.hpp>
#include <platform/driver/lcd/LCD16bpp.hpp>
#include <platform/driver/lcd/LCD24bpp.hpp>

#include <STM32H7DMA.hpp>
#include <STM32H7HAL.hpp>

#include <STM32H7TouchController.hpp>
#include <STM32H7Instrumentation.hpp>

#include <KeySampler.hpp>

#include "cmsis_os.h"
#include <FreeRTOS.h>
#include <queue.h>
#include "clock_weather_app.h"

/***********************************************************
******         24 Bits Per Pixel Support            *******
***********************************************************
*
* The default bit depth of the framebuffer is 16bpp. If you want 24bpp support, define the symbol "USE_BPP" with a value
* of "24", e.g. "USE_BPP=24". This symbol affects the following:
*
* 1. Type of TouchGFX LCD (16bpp vs 24bpp)
* 2. Bit depth of the framebuffer(s)
* 3. TFT controller configuration.
*
* WARNING: Remember to modify your image formats accordingly in app/config/. Please see the following knowledgebase article
* for further details on how to choose and configure the appropriate image formats for your application:
*
* https://touchgfx.zendesk.com/hc/en-us/articles/206725849
*/

extern "C" {
#include "stm32h7xx_hal.h"
  
#include "stm32h7b3i_eval.h"
#include "stm32h7b3i_eval_sdram.h"
#include "stm32h7b3i_eval_ospi.h"
  
#include "../Components/rk070er9427/rk070er9427.h"
#include "../Components/ft5336/ft5336.h"
  
int RNG_Init(void);
LTDC_HandleTypeDef hltdc;
DMA2D_HandleTypeDef hdma2d;
RNG_HandleTypeDef RngHandle;
  
}

/* External variables --------------------------------------------------------*/
#if configAPPLICATION_ALLOCATED_HEAP == 1
#if defined ( __GNUC__ ) || defined( __CC_ARM )
__attribute__((section(".heap_mem"))) __attribute__ ((aligned (32)))
#elif defined ( __ICCARM__ )
#pragma data_alignment=32
#pragma location="heap_mem"
#endif
uint8_t ucHeap[ configTOTAL_HEAP_SIZE ];
#endif /* configAPPLICATION_ALLOCATED_HEAP */

//LCD Configuration Defines
#define LCD_HSYNC       RK070ER9427_HSYNC
#define LCD_VSYNC       RK070ER9427_VSYNC
#define LCD_HBP         RK070ER9427_HBP
#define LCD_HFP         RK070ER9427_HFP
#define LCD_VBP         RK070ER9427_VBP
#define LCD_VFP         RK070ER9427_VFP
#define LCD_WIDTH       RK070ER9427_WIDTH
#define LCD_HEIGHT      RK070ER9427_HEIGHT

#if !defined(USE_BPP) || USE_BPP==16
#define FRAMEBUFFER_SIZE  (LCD_WIDTH * LCD_HEIGHT * 2)
#elif USE_BPP==24
#define FRAMEBUFFER_SIZE  (LCD_WIDTH * LCD_HEIGHT * 3)
#else
#error Unknown USE_BPP
#endif

#define FB_BUFFER_NBR     2
#define BMP_CACHE_SIZE    (128 * 1024)

/**
* @brief LCD special pins
*/
/* LCD Display control pin */
#define LCD_DISP_CTRL_PIN                     GPIO_PIN_2
#define LCD_DISP_CTRL_PULL                    GPIO_NOPULL
#define LCD_DISP_CTRL_GPIO_PORT               GPIOA
#define LCD_DISP_CTRL_GPIO_CLK_ENABLE()       __HAL_RCC_GPIOA_CLK_ENABLE()
#define LCD_DISP_CTRL_GPIO_CLK_DISABLE()      __HAL_RCC_GPIOA_CLK_DISABLE()

/* LCD Display enable pin */
#define LCD_DISP_EN_PIN                      GPIO_PIN_7
#define LCD_DISP_EN_PULL                     GPIO_NOPULL
#define LCD_DISP_EN_GPIO_PORT                GPIOK
#define LCD_DISP_EN_GPIO_CLK_ENABLE()        __HAL_RCC_GPIOK_CLK_ENABLE()
#define LCD_DISP_EN_GPIO_CLK_DISABLE()       __HAL_RCC_GPIOK_CLK_DISABLE()

/* Back-light control pin */
#define LCD_BL_CTRL_PIN                       GPIO_PIN_1
#define LCD_BL_CTRL_PULL                      GPIO_NOPULL
#define LCD_BL_CTRL_GPIO_PORT                 GPIOA
#define LCD_BL_CTRL_GPIO_CLK_ENABLE()         __HAL_RCC_GPIOA_CLK_ENABLE()
#define LCD_BL_CTRL_GPIO_CLK_DISABLE()        __HAL_RCC_GPIOA_CLK_DISABLE()

#if defined ( __GNUC__ )
__attribute__((section(".FBSection"))) __attribute__ ((aligned (32)))
#elif defined ( __ICCARM__ )
#pragma data_alignment=32
#pragma location="FBSection"
#elif defined( __CC_ARM )
__attribute__((section(".FBSection"), zero_init)) __attribute__ ((aligned (32)))
#endif
static uint8_t framebuffer[FB_BUFFER_NBR][FRAMEBUFFER_SIZE];

#if defined ( __GNUC__ )
__attribute__((section(".BmpCacheSection"))) __attribute__ ((aligned (32)))
#elif defined ( __ICCARM__ )
#pragma data_alignment=32
#pragma location="BmpCacheSection"
#elif defined( __CC_ARM )
__attribute__((section(".BmpCacheSection"), zero_init)) __attribute__ ((aligned (32)))
#endif
static uint8_t BmpCache[BMP_CACHE_SIZE];

static uint32_t frameBuf0 = (uint32_t)(&framebuffer);
static uint8_t* bmpCache  = BmpCache;

uint32_t      user_button_press = BUTTONn;
QueueHandle_t ButtonEventQueue  = 0;

extern "C" uint32_t LCD_GetXSize()
{
  return LCD_WIDTH;
}

extern "C" uint32_t LCD_GetYSize()
{
  return LCD_HEIGHT;
}

/**
* @brief  This function is executed in case of error occurrence.
* @param  None
* @retval None
*/
static void Error_Handler(void)
{
  BSP_LED_On(LED_RED);
  
  /* User may add here some code to deal with this error */
  while(1)
  {
  }
}

/**
* @brief  Initializes the LCD layers.
* @param  LayerIndex: Layer foreground or background
* @param  FB_Address: Layer frame buffer
* @retval None
*/
static void LCD_LayerDefaultInit(uint16_t LayerIndex, uint32_t Address)
{
  LTDC_LayerCfgTypeDef Layercfg;
  
  /* Layer Init */
  Layercfg.WindowX0 = 0;
  Layercfg.WindowY0 = 0;
  Layercfg.WindowX1 = LCD_GetXSize();
  Layercfg.WindowY1 = LCD_GetYSize();
  Layercfg.FBStartAdress = Address;
  Layercfg.Alpha = 255;
  Layercfg.Alpha0 = 0;
  Layercfg.Backcolor.Blue = 0;
  Layercfg.Backcolor.Green = 0;
  Layercfg.Backcolor.Red = 0;
  Layercfg.ImageWidth = LCD_GetXSize();
  Layercfg.ImageHeight = LCD_GetYSize();
  Layercfg.BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
  Layercfg.BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;
#if !defined(USE_BPP) || USE_BPP==16
  Layercfg.PixelFormat = LTDC_PIXEL_FORMAT_RGB565;
#elif USE_BPP==24
  Layercfg.PixelFormat = LTDC_PIXEL_FORMAT_RGB888;
#else
#error Unknown USE_BPP
#endif
  
  HAL_LTDC_ConfigLayer(&hltdc, &Layercfg, LayerIndex);
}

extern "C" void HAL_LTDC_MspDeInit(LTDC_HandleTypeDef* hltdc)
{
  __HAL_RCC_LTDC_FORCE_RESET();
  __HAL_RCC_LTDC_RELEASE_RESET();
}

void OneTimeInitializeDefaultLayer()
{
  static bool intialized = false;
  if (!intialized)
  {
    intialized = true;
    LCD_LayerDefaultInit(0, frameBuf0);
  }
}

/**
* @brief  LCD Reset
*         Hw reset the LCD DSI activating its XRES signal (active low for some time)
*         and deactivating it later.
* @param  None
*/
static void LCD_Reset(void)
{
  GPIO_InitTypeDef  gpio_init_structure;
  
  LCD_DISP_CTRL_GPIO_CLK_ENABLE();
  
  /* Configure the GPIO Reset pin */
  gpio_init_structure.Pin   = LCD_DISP_CTRL_PIN;
  gpio_init_structure.Mode  = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Pull  = LCD_DISP_CTRL_PULL;
  gpio_init_structure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(LCD_DISP_CTRL_GPIO_PORT , &gpio_init_structure);
  
  /* Activate XRES active low */
  HAL_GPIO_WritePin(LCD_DISP_CTRL_GPIO_PORT , LCD_DISP_CTRL_PIN, GPIO_PIN_RESET);
  HAL_Delay(20);/* wait 20 ms */
  HAL_GPIO_WritePin(LCD_DISP_CTRL_GPIO_PORT , LCD_DISP_CTRL_PIN, GPIO_PIN_SET);/* Deactivate XRES */
  HAL_Delay(10);/* Wait for 10ms after releasing XRES before sending commands */
}

/**
* @brief  Configure LCD control pins (Back-light, Display Enable and TE)
* @retval None
*/
static void LCD_InitSequence(void)
{
  GPIO_InitTypeDef  gpio_init_structure;
  /* LCD_DISP GPIO configuration */
  LCD_DISP_EN_GPIO_CLK_ENABLE();
  
  gpio_init_structure.Pin       = LCD_DISP_EN_PIN;
  gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(LCD_DISP_EN_GPIO_PORT, &gpio_init_structure);
  /* Assert LCD_DISP  pin */
  HAL_GPIO_WritePin(LCD_DISP_EN_GPIO_PORT, LCD_DISP_EN_PIN, GPIO_PIN_SET);
  
  /* LCD_BL_CTRL GPIO configuration */
  LCD_BL_CTRL_GPIO_CLK_ENABLE();
  
  gpio_init_structure.Pin       = LCD_BL_CTRL_PIN;
  gpio_init_structure.Mode      = GPIO_MODE_OUTPUT_PP;
  gpio_init_structure.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
  HAL_GPIO_Init(LCD_BL_CTRL_GPIO_PORT, &gpio_init_structure);
  /* Assert back-light LCD_BL_CTRL pin */
  HAL_GPIO_WritePin(LCD_BL_CTRL_GPIO_PORT, LCD_BL_CTRL_PIN, GPIO_PIN_SET);
}

/**
* @brief  Initialize the BSP LCD Msp.
* Application can surcharge if needed this function implementation
*/
static void LCD_MspInit(void)
{
  GPIO_InitTypeDef  gpio_init_structure;
  
  if(hltdc.Instance == LTDC)
  {
    /* Enable the LTDC and DMA2D clocks */
    __HAL_RCC_LTDC_CLK_ENABLE();
    __HAL_RCC_DMA2D_CLK_ENABLE();
    
