STMicroelectronics/STM32CubeH7/Projects/STM32H7B3I-EVAL/Demonstrations/ClockAndWeather/TouchGFX/target/BoardConfiguration.cpp
    BSP_OSPI_NOR_DeInit(0);
    
    Flash.InterfaceMode = BSP_OSPI_NOR_OPI_MODE;
    Flash.TransferRate  = BSP_OSPI_NOR_DTR_TRANSFER;
    if(BSP_OSPI_NOR_Init(0, &Flash) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }
    if(BSP_OSPI_NOR_EnableMemoryMappedMode(0) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }
  }
  
  static void ConfigureExternalRam(void)
  {
    /* Initialize the SDRAM memory */
    if (BSP_SDRAM_Init(0) != BSP_ERROR_NONE)
    {
      Error_Handler();
    }
  }
  
  /**
  * @brief  Initializes LEDs, SDRAM, touch screen, CRC and SRAM.
  * @param  None
  * @retval RetVal
  */
  static void BspInit(void)
  {
    /* Initialize the External Ram */
    ConfigureExternalRam();
    
    /* Initialize the External Rom */
    ConfigureExternalRom();
  }
  
  
  void hw_init()
  {
    SCB_EnableICache();
    SCB_EnableDCache();
    
    MPU_Config();
    
    HAL_Init();
    
    SystemClock_Config();
    
    HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSE, RCC_MCODIV_1);
    
    __HAL_RCC_CRC_CLK_ENABLE();
    
    GPIO::init();
    
    /* For error reporting */
    BSP_LED_Init(LED_RED);
    BSP_LED_Off(LED_RED);
    
    BspInit();
    
    /* Disable FMC Bank1 to avoid speculative/cache accesses */
    FMC_Bank1_R->BTCR[0] &= ~FMC_BCRx_MBKEN;
    
    /* Initialize display */
    LCD_Init();
    
    /* Initialize WIFI*/
    WIFI_Init();
    
    /* Initialize RNG */
    RNG_Init();  
    
  }
  
#if !defined(USE_BPP) || USE_BPP==16
  static LCD16bpp display;
  static uint16_t bitDepth = 16;
#elif USE_BPP==24
  static LCD24bpp display;
  static uint16_t bitDepth = 24;
#else
#error Unknown USE_BPP
#endif
  
  void touchgfx_init()
  {
    STM32H7DMA *dma = new STM32H7DMA;
    STM32H7TouchController *tc = new STM32H7TouchController;
    STM32H7Instrumentation *mcuInstr = new STM32H7Instrumentation;
    
    uint16_t dispWidth  = LCD_GetXSize();
    uint16_t dispHeight = LCD_GetYSize();
    
    HAL& hal = touchgfx_generic_init<STM32H7HAL>(*dma, display, *tc, dispWidth, dispHeight,
                                                 (uint16_t*)bmpCache, BMP_CACHE_SIZE, 128);
    
    hal.setFrameBufferStartAddress((uint16_t*)frameBuf0, bitDepth, true, true);
    
    hal.setTouchSampleRate(1);
    hal.setFingerSize(8);
    // By default frame rate compensation is off.
    // Enable frame rate compensation to smooth out animations in case there is periodic slow frame rates.
    hal.setFrameRateCompensation(true);
    
    // This platform can handle simultaneous DMA and TFT accesses to SDRAM, so disable lock to increase performance.
    hal.lockDMAToFrontPorch(true);
    
    mcuInstr->init();
    
    //Set MCU instrumentation and Load calculation
    hal.setMCUInstrumentation(mcuInstr);
    hal.enableMCULoadCalculation(true);
  }
}

int RNG_Init(void)
{
  /* Configure the RNG peripheral */
  RngHandle.Instance = RNG;
  
  /* DeInitialize the RNG peripheral */
  if (HAL_RNG_DeInit(&RngHandle) != HAL_OK)
  {
    /* DeInitialization Error */
    return 1;
  }    
  
  /* Initialize the RNG peripheral */
  if (HAL_RNG_Init(&RngHandle) != HAL_OK)
  {
    /* Initialization Error */
    return 1;
  }
  return 0;
}

/**
* @brief RNG MSP Initialization
*        This function configures the hardware resources used in this example:
*           - Peripheral's clock enable
* @param hrng: RNG handle pointer
* @retval None
*/
void HAL_RNG_MspInit(RNG_HandleTypeDef *hrng)
{
  RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
  
  /*Select PLL output as RNG clock source */
  PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RNG;
  PeriphClkInitStruct.RngClockSelection = RCC_RNGCLKSOURCE_PLL;
  if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct))
  {
    /* Initialization Error */
    while(1);
  }
  
  /* RNG Peripheral clock enable */
  __HAL_RCC_RNG_CLK_ENABLE();
  
}

/**
* @brief RNG MSP De-Initialization
*        This function freeze the hardware resources used in this example:
*          - Disable the Peripheral's clock
* @param hrng: RNG handle pointer
* @retval None
*/
void HAL_RNG_MspDeInit(RNG_HandleTypeDef *hrng)
{
  /* Enable RNG reset state */
  __HAL_RCC_RNG_FORCE_RESET();
  
  /* Release RNG from reset state */
  __HAL_RCC_RNG_RELEASE_RESET();
}

